espressif/esp-idf/components/soc/esp32s31/register/soc/lp_spi_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_SPI_CMD_REG register
 *  Command control register
 */
#define LP_SPI_CMD_REG (DR_REG_LP_BASE + 0x0)
/** LP_REG_UPDATE : WT; bitpos: [23]; default: 0;
 *  Set this bit to synchronize SPI registers from APB clock domain into SPI module
 *  clock domain, which is only used in SPI master mode.
 */
#define LP_REG_UPDATE    (BIT(23))
#define LP_REG_UPDATE_M  (LP_REG_UPDATE_V << LP_REG_UPDATE_S)
#define LP_REG_UPDATE_V  0x00000001U
#define LP_REG_UPDATE_S  23
/** LP_REG_USR : R/W/SC; bitpos: [24]; default: 0;
 *  User define command enable.  An operation will be triggered when the bit is set.
 *  The bit will be cleared once the operation done.1: enable 0: disable. Can not be
 *  changed by CONF_buf.
 */
#define LP_REG_USR    (BIT(24))
#define LP_REG_USR_M  (LP_REG_USR_V << LP_REG_USR_S)
#define LP_REG_USR_V  0x00000001U
#define LP_REG_USR_S  24

/** LP_SPI_ADDR_REG register
 *  Address value register
 */
#define LP_SPI_ADDR_REG (DR_REG_LP_BASE + 0x4)
/** LP_REG_USR_ADDR_VALUE : R/W; bitpos: [31:0]; default: 0;
 *  Address to slave. Can be configured in CONF state.
 */
#define LP_REG_USR_ADDR_VALUE    0xFFFFFFFFU
#define LP_REG_USR_ADDR_VALUE_M  (LP_REG_USR_ADDR_VALUE_V << LP_REG_USR_ADDR_VALUE_S)
#define LP_REG_USR_ADDR_VALUE_V  0xFFFFFFFFU
#define LP_REG_USR_ADDR_VALUE_S  0

/** LP_SPI_CTRL_REG register
 *  SPI control register
 */
#define LP_SPI_CTRL_REG (DR_REG_LP_BASE + 0x8)
/** LP_REG_DUMMY_OUT : R/W; bitpos: [3]; default: 0;
 *  In the dummy phase the signal level of spi is output by the spi controller. Can be
 *  configured in CONF state.
 */
#define LP_REG_DUMMY_OUT    (BIT(3))
#define LP_REG_DUMMY_OUT_M  (LP_REG_DUMMY_OUT_V << LP_REG_DUMMY_OUT_S)
#define LP_REG_DUMMY_OUT_V  0x00000001U
#define LP_REG_DUMMY_OUT_S  3
/** LP_REG_Q_POL : R/W; bitpos: [18]; default: 1;
 *  The bit is used to set MISO line polarity, 1: high 0, low. Can be configured in
 *  CONF state.
 */
#define LP_REG_Q_POL    (BIT(18))
#define LP_REG_Q_POL_M  (LP_REG_Q_POL_V << LP_REG_Q_POL_S)
#define LP_REG_Q_POL_V  0x00000001U
#define LP_REG_Q_POL_S  18
/** LP_REG_D_POL : R/W; bitpos: [19]; default: 1;
 *  The bit is used to set MOSI line polarity, 1: high 0, low. Can be configured in
 *  CONF state.
 */
#define LP_REG_D_POL    (BIT(19))
#define LP_REG_D_POL_M  (LP_REG_D_POL_V << LP_REG_D_POL_S)
#define LP_REG_D_POL_V  0x00000001U
#define LP_REG_D_POL_S  19
/** LP_REG_RD_BIT_ORDER : R/W; bitpos: [25]; default: 0;
 *  In read-data (MISO) phase 1: LSB first 0: MSB first. Can be configured in CONF
 *  state.
 */
#define LP_REG_RD_BIT_ORDER    (BIT(25))
#define LP_REG_RD_BIT_ORDER_M  (LP_REG_RD_BIT_ORDER_V << LP_REG_RD_BIT_ORDER_S)
#define LP_REG_RD_BIT_ORDER_V  0x00000001U
#define LP_REG_RD_BIT_ORDER_S  25
/** LP_REG_WR_BIT_ORDER : R/W; bitpos: [26]; default: 0;
 *  In command address write-data (MOSI) phases 1: LSB firs 0: MSB first. Can be
 *  configured in CONF state.
 */
#define LP_REG_WR_BIT_ORDER    (BIT(26))
#define LP_REG_WR_BIT_ORDER_M  (LP_REG_WR_BIT_ORDER_V << LP_REG_WR_BIT_ORDER_S)
#define LP_REG_WR_BIT_ORDER_V  0x00000001U
#define LP_REG_WR_BIT_ORDER_S  26

/** LP_SPI_CLOCK_REG register
 *  SPI clock control register
 */
#define LP_SPI_CLOCK_REG (DR_REG_LP_BASE + 0xc)
/** LP_REG_CLKCNT_L : R/W; bitpos: [5:0]; default: 3;
 *  In the master mode it must be equal to spi_clkcnt_N. In the slave mode it must be
 *  0. Can be configured in CONF state.
 */
#define LP_REG_CLKCNT_L    0x0000003FU
#define LP_REG_CLKCNT_L_M  (LP_REG_CLKCNT_L_V << LP_REG_CLKCNT_L_S)
#define LP_REG_CLKCNT_L_V  0x0000003FU
#define LP_REG_CLKCNT_L_S  0
/** LP_REG_CLKCNT_H : R/W; bitpos: [11:6]; default: 1;
 *  In the master mode it must be floor((spi_clkcnt_N+1)/2-1). In the slave mode it
 *  must be 0. Can be configured in CONF state.
 */
#define LP_REG_CLKCNT_H    0x0000003FU
#define LP_REG_CLKCNT_H_M  (LP_REG_CLKCNT_H_V << LP_REG_CLKCNT_H_S)
#define LP_REG_CLKCNT_H_V  0x0000003FU
#define LP_REG_CLKCNT_H_S  6
/** LP_REG_CLKCNT_N : R/W; bitpos: [17:12]; default: 3;
 *  In the master mode it is the divider of spi_clk. So spi_clk frequency is
 *  system/(spi_clkdiv_pre+1)/(spi_clkcnt_N+1). Can be configured in CONF state.
 */
#define LP_REG_CLKCNT_N    0x0000003FU
#define LP_REG_CLKCNT_N_M  (LP_REG_CLKCNT_N_V << LP_REG_CLKCNT_N_S)
#define LP_REG_CLKCNT_N_V  0x0000003FU
#define LP_REG_CLKCNT_N_S  12
/** LP_REG_CLKDIV_PRE : R/W; bitpos: [21:18]; default: 0;
 *  In the master mode it is pre-divider of spi_clk.  Can be configured in CONF state.
 */
#define LP_REG_CLKDIV_PRE    0x0000000FU
#define LP_REG_CLKDIV_PRE_M  (LP_REG_CLKDIV_PRE_V << LP_REG_CLKDIV_PRE_S)
#define LP_REG_CLKDIV_PRE_V  0x0000000FU
#define LP_REG_CLKDIV_PRE_S  18
/** LP_REG_CLK_EQU_SYSCLK : R/W; bitpos: [31]; default: 1;
 *  In the master mode 1: spi_clk is equal to system 0: spi_clk is divided from system
 *  clock. Can be configured in CONF state.
 */
#define LP_REG_CLK_EQU_SYSCLK    (BIT(31))
#define LP_REG_CLK_EQU_SYSCLK_M  (LP_REG_CLK_EQU_SYSCLK_V << LP_REG_CLK_EQU_SYSCLK_S)
#define LP_REG_CLK_EQU_SYSCLK_V  0x00000001U
#define LP_REG_CLK_EQU_SYSCLK_S  31

/** LP_SPI_USER_REG register
 *  SPI USER control register
 */
#define LP_SPI_USER_REG (DR_REG_LP_BASE + 0x10)
/** LP_REG_DOUTDIN : R/W; bitpos: [0]; default: 0;
 *  Set the bit to enable full duplex communication. 1: enable 0: disable. Can be
 *  configured in CONF state.
 */
#define LP_REG_DOUTDIN    (BIT(0))
#define LP_REG_DOUTDIN_M  (LP_REG_DOUTDIN_V << LP_REG_DOUTDIN_S)
#define LP_REG_DOUTDIN_V  0x00000001U
#define LP_REG_DOUTDIN_S  0
/** LP_REG_TSCK_I_EDGE : R/W; bitpos: [5]; default: 0;
 *  In the slave mode, this bit can be used to change the polarity of tsck. 0: tsck =
 *  spi_ck_i. 1:tsck = !spi_ck_i.
 */
#define LP_REG_TSCK_I_EDGE    (BIT(5))
#define LP_REG_TSCK_I_EDGE_M  (LP_REG_TSCK_I_EDGE_V << LP_REG_TSCK_I_EDGE_S)
#define LP_REG_TSCK_I_EDGE_V  0x00000001U
#define LP_REG_TSCK_I_EDGE_S  5
/** LP_REG_CS_HOLD : R/W; bitpos: [6]; default: 1;
 *  spi cs keep low when spi is in  done  phase. 1: enable 0: disable. Can be
 *  configured in CONF state.
 */
#define LP_REG_CS_HOLD    (BIT(6))
#define LP_REG_CS_HOLD_M  (LP_REG_CS_HOLD_V << LP_REG_CS_HOLD_S)
#define LP_REG_CS_HOLD_V  0x00000001U
#define LP_REG_CS_HOLD_S  6
/** LP_REG_CS_SETUP : R/W; bitpos: [7]; default: 1;
 *  spi cs is enable when spi is in  prepare  phase. 1: enable 0: disable. Can be
 *  configured in CONF state.
 */
#define LP_REG_CS_SETUP    (BIT(7))
#define LP_REG_CS_SETUP_M  (LP_REG_CS_SETUP_V << LP_REG_CS_SETUP_S)
#define LP_REG_CS_SETUP_V  0x00000001U
#define LP_REG_CS_SETUP_S  7
/** LP_REG_RSCK_I_EDGE : R/W; bitpos: [8]; default: 0;
 *  In the slave mode, this bit can be used to change the polarity of rsck. 0: rsck =
 *  !spi_ck_i. 1:rsck = spi_ck_i.
 */
#define LP_REG_RSCK_I_EDGE    (BIT(8))
#define LP_REG_RSCK_I_EDGE_M  (LP_REG_RSCK_I_EDGE_V << LP_REG_RSCK_I_EDGE_S)
#define LP_REG_RSCK_I_EDGE_V  0x00000001U
#define LP_REG_RSCK_I_EDGE_S  8
/** LP_REG_CK_OUT_EDGE : R/W; bitpos: [9]; default: 0;
 *  the bit combined with spi_mosi_delay_mode bits to set mosi signal delay mode. Can
 *  be configured in CONF state.
 */
#define LP_REG_CK_OUT_EDGE    (BIT(9))
#define LP_REG_CK_OUT_EDGE_M  (LP_REG_CK_OUT_EDGE_V << LP_REG_CK_OUT_EDGE_S)
#define LP_REG_CK_OUT_EDGE_V  0x00000001U
#define LP_REG_CK_OUT_EDGE_S  9
/** LP_REG_SIO : R/W; bitpos: [17]; default: 0;
 *  Set the bit to enable 3-line half duplex communication mosi and miso signals share
 *  the same pin. 1: enable 0: disable. Can be configured in CONF state.
 */
#define LP_REG_SIO    (BIT(17))
#define LP_REG_SIO_M  (LP_REG_SIO_V << LP_REG_SIO_S)
#define LP_REG_SIO_V  0x00000001U
#define LP_REG_SIO_S  17
/** LP_REG_USR_MISO_HIGHPART : R/W; bitpos: [24]; default: 0;
 *  read-data phase only access to high-part of the buffer spi_w8~spi_w15. 1: enable 0:
 *  disable. Can be configured in CONF state.
 */
#define LP_REG_USR_MISO_HIGHPART    (BIT(24))
#define LP_REG_USR_MISO_HIGHPART_M  (LP_REG_USR_MISO_HIGHPART_V << LP_REG_USR_MISO_HIGHPART_S)
#define LP_REG_USR_MISO_HIGHPART_V  0x00000001U
#define LP_REG_USR_MISO_HIGHPART_S  24
/** LP_REG_USR_MOSI_HIGHPART : R/W; bitpos: [25]; default: 0;
 *  write-data phase only access to high-part of the buffer spi_w8~spi_w15. 1: enable
 *  0: disable.  Can be configured in CONF state.
 */
#define LP_REG_USR_MOSI_HIGHPART    (BIT(25))
#define LP_REG_USR_MOSI_HIGHPART_M  (LP_REG_USR_MOSI_HIGHPART_V << LP_REG_USR_MOSI_HIGHPART_S)
#define LP_REG_USR_MOSI_HIGHPART_V  0x00000001U
#define LP_REG_USR_MOSI_HIGHPART_S  25
/** LP_REG_USR_DUMMY_IDLE : R/W; bitpos: [26]; default: 0;
 *  spi clock is disable in dummy phase when the bit is enable. Can be configured in
 *  CONF state.
 */
#define LP_REG_USR_DUMMY_IDLE    (BIT(26))
#define LP_REG_USR_DUMMY_IDLE_M  (LP_REG_USR_DUMMY_IDLE_V << LP_REG_USR_DUMMY_IDLE_S)
#define LP_REG_USR_DUMMY_IDLE_V  0x00000001U
#define LP_REG_USR_DUMMY_IDLE_S  26
/** LP_REG_USR_MOSI : R/W; bitpos: [27]; default: 0;
 *  This bit enable the write-data phase of an operation. Can be configured in CONF
 *  state.
 */
#define LP_REG_USR_MOSI    (BIT(27))
#define LP_REG_USR_MOSI_M  (LP_REG_USR_MOSI_V << LP_REG_USR_MOSI_S)
#define LP_REG_USR_MOSI_V  0x00000001U
#define LP_REG_USR_MOSI_S  27
/** LP_REG_USR_MISO : R/W; bitpos: [28]; default: 0;
 *  This bit enable the read-data phase of an operation. Can be configured in CONF
 *  state.
 */
#define LP_REG_USR_MISO    (BIT(28))
#define LP_REG_USR_MISO_M  (LP_REG_USR_MISO_V << LP_REG_USR_MISO_S)
#define LP_REG_USR_MISO_V  0x00000001U
#define LP_REG_USR_MISO_S  28
/** LP_REG_USR_DUMMY : R/W; bitpos: [29]; default: 0;
 *  This bit enable the dummy phase of an operation. Can be configured in CONF state.
 */
#define LP_REG_USR_DUMMY    (BIT(29))
#define LP_REG_USR_DUMMY_M  (LP_REG_USR_DUMMY_V << LP_REG_USR_DUMMY_S)
#define LP_REG_USR_DUMMY_V  0x00000001U
#define LP_REG_USR_DUMMY_S  29
/** LP_REG_USR_ADDR : R/W; bitpos: [30]; default: 0;
 *  This bit enable the address phase of an operation. Can be configured in CONF state.
 */
#define LP_REG_USR_ADDR    (BIT(30))
#define LP_REG_USR_ADDR_M  (LP_REG_USR_ADDR_V << LP_REG_USR_ADDR_S)
#define LP_REG_USR_ADDR_V  0x00000001U
#define LP_REG_USR_ADDR_S  30
/** LP_REG_USR_COMMAND : R/W; bitpos: [31]; default: 1;
 *  This bit enable the command phase of an operation. Can be configured in CONF state.
 */
#define LP_REG_USR_COMMAND    (BIT(31))
#define LP_REG_USR_COMMAND_M  (LP_REG_USR_COMMAND_V << LP_REG_USR_COMMAND_S)
#define LP_REG_USR_COMMAND_V  0x00000001U
#define LP_REG_USR_COMMAND_S  31

/** LP_SPI_USER1_REG register
 *  SPI USER control register 1
 */
#define LP_SPI_USER1_REG (DR_REG_LP_BASE + 0x14)
/** LP_REG_USR_DUMMY_CYCLELEN : R/W; bitpos: [7:0]; default: 7;
 *  The length in spi_clk cycles of dummy phase. The register value shall be
 *  (cycle_num-1). Can be configured in CONF state.
 */
#define LP_REG_USR_DUMMY_CYCLELEN    0x000000FFU
#define LP_REG_USR_DUMMY_CYCLELEN_M  (LP_REG_USR_DUMMY_CYCLELEN_V << LP_REG_USR_DUMMY_CYCLELEN_S)
#define LP_REG_USR_DUMMY_CYCLELEN_V  0x000000FFU
#define LP_REG_USR_DUMMY_CYCLELEN_S  0
/** LP_REG_MST_WFULL_ERR_END_EN : R/W; bitpos: [16]; default: 1;
 *  1: SPI transfer is ended when SPI RX AFIFO wfull error is valid in GP-SPI master
 *  FD/HD-mode. 0: SPI transfer is not ended when SPI RX AFIFO wfull error is valid in
 *  GP-SPI master FD/HD-mode.
 */
#define LP_REG_MST_WFULL_ERR_END_EN    (BIT(16))
#define LP_REG_MST_WFULL_ERR_END_EN_M  (LP_REG_MST_WFULL_ERR_END_EN_V << LP_REG_MST_WFULL_ERR_END_EN_S)
#define LP_REG_MST_WFULL_ERR_END_EN_V  0x00000001U
#define LP_REG_MST_WFULL_ERR_END_EN_S  16
/** LP_REG_CS_SETUP_TIME : R/W; bitpos: [21:17]; default: 0;
 *  (cycles+1) of prepare phase by spi clock this bits are combined with spi_cs_setup
 *  bit. Can be configured in CONF state.
 */
#define LP_REG_CS_SETUP_TIME    0x0000001FU
#define LP_REG_CS_SETUP_TIME_M  (LP_REG_CS_SETUP_TIME_V << LP_REG_CS_SETUP_TIME_S)
#define LP_REG_CS_SETUP_TIME_V  0x0000001FU
#define LP_REG_CS_SETUP_TIME_S  17
/** LP_REG_CS_HOLD_TIME : R/W; bitpos: [26:22]; default: 1;
 *  delay cycles of cs pin by spi clock this bits are combined with spi_cs_hold bit.
 *  Can be configured in CONF state.
 */
#define LP_REG_CS_HOLD_TIME    0x0000001FU
#define LP_REG_CS_HOLD_TIME_M  (LP_REG_CS_HOLD_TIME_V << LP_REG_CS_HOLD_TIME_S)
#define LP_REG_CS_HOLD_TIME_V  0x0000001FU
#define LP_REG_CS_HOLD_TIME_S  22
/** LP_REG_USR_ADDR_BITLEN : R/W; bitpos: [31:27]; default: 23;
 *  The length in bits of address phase. The register value shall be (bit_num-1). Can
 *  be configured in CONF state.
 */
#define LP_REG_USR_ADDR_BITLEN    0x0000001FU
#define LP_REG_USR_ADDR_BITLEN_M  (LP_REG_USR_ADDR_BITLEN_V << LP_REG_USR_ADDR_BITLEN_S)
#define LP_REG_USR_ADDR_BITLEN_V  0x0000001FU
#define LP_REG_USR_ADDR_BITLEN_S  27

/** LP_SPI_USER2_REG register
 *  SPI USER control register 2
 */
#define LP_SPI_USER2_REG (DR_REG_LP_BASE + 0x18)
/** LP_REG_USR_COMMAND_VALUE : R/W; bitpos: [15:0]; default: 0;
 *  The value of  command. Can be configured in CONF state.
 */
#define LP_REG_USR_COMMAND_VALUE    0x0000FFFFU
#define LP_REG_USR_COMMAND_VALUE_M  (LP_REG_USR_COMMAND_VALUE_V << LP_REG_USR_COMMAND_VALUE_S)
#define LP_REG_USR_COMMAND_VALUE_V  0x0000FFFFU
#define LP_REG_USR_COMMAND_VALUE_S  0
/** LP_REG_MST_REMPTY_ERR_END_EN : R/W; bitpos: [27]; default: 1;
 *  1: SPI transfer is ended when SPI TX AFIFO read empty error is valid in GP-SPI
 *  master FD/HD-mode. 0: SPI transfer is not ended when SPI TX AFIFO read empty error
 *  is valid in GP-SPI master FD/HD-mode.
 */
#define LP_REG_MST_REMPTY_ERR_END_EN    (BIT(27))
#define LP_REG_MST_REMPTY_ERR_END_EN_M  (LP_REG_MST_REMPTY_ERR_END_EN_V << LP_REG_MST_REMPTY_ERR_END_EN_S)
#define LP_REG_MST_REMPTY_ERR_END_EN_V  0x00000001U
#define LP_REG_MST_REMPTY_ERR_END_EN_S  27
/** LP_REG_USR_COMMAND_BITLEN : R/W; bitpos: [31:28]; default: 7;
 *  The length in bits of command phase. The register value shall be (bit_num-1). Can
 *  be configured in CONF state.
 */
#define LP_REG_USR_COMMAND_BITLEN    0x0000000FU
#define LP_REG_USR_COMMAND_BITLEN_M  (LP_REG_USR_COMMAND_BITLEN_V << LP_REG_USR_COMMAND_BITLEN_S)
#define LP_REG_USR_COMMAND_BITLEN_V  0x0000000FU
#define LP_REG_USR_COMMAND_BITLEN_S  28

