espressif/esp-idf/components/soc/esp32s31/register/soc/lp_spi_reg.h
/** LP_SPI_MS_DLEN_REG register
 *  SPI data bit length control register
 */
#define LP_SPI_MS_DLEN_REG (DR_REG_LP_BASE + 0x1c)
/** LP_REG_MS_DATA_BITLEN : R/W; bitpos: [17:0]; default: 0;
 *  The value of these bits is the configured SPI transmission data bit length in
 *  master mode DMA controlled transfer or CPU controlled transfer. The value is also
 *  the configured bit length in slave mode DMA RX controlled transfer. The register
 *  value shall be (bit_num-1). Can be configured in CONF state.
 */
#define LP_REG_MS_DATA_BITLEN    0x0003FFFFU
#define LP_REG_MS_DATA_BITLEN_M  (LP_REG_MS_DATA_BITLEN_V << LP_REG_MS_DATA_BITLEN_S)
#define LP_REG_MS_DATA_BITLEN_V  0x0003FFFFU
#define LP_REG_MS_DATA_BITLEN_S  0

/** LP_SPI_MISC_REG register
 *  SPI misc register
 */
#define LP_SPI_MISC_REG (DR_REG_LP_BASE + 0x20)
/** LP_REG_CS0_DIS : R/W; bitpos: [0]; default: 0;
 *  SPI CS$n pin enable, 1: disable CS$n, 0: spi_cs$n signal is from/to CS$n pin. Can
 *  be configured in CONF state.
 */
#define LP_REG_CS0_DIS    (BIT(0))
#define LP_REG_CS0_DIS_M  (LP_REG_CS0_DIS_V << LP_REG_CS0_DIS_S)
#define LP_REG_CS0_DIS_V  0x00000001U
#define LP_REG_CS0_DIS_S  0
/** LP_REG_CK_DIS : R/W; bitpos: [6]; default: 0;
 *  1: spi clk out disable,  0: spi clk out enable. Can be configured in CONF state.
 */
#define LP_REG_CK_DIS    (BIT(6))
#define LP_REG_CK_DIS_M  (LP_REG_CK_DIS_V << LP_REG_CK_DIS_S)
#define LP_REG_CK_DIS_V  0x00000001U
#define LP_REG_CK_DIS_S  6
/** LP_REG_MASTER_CS_POL : R/W; bitpos: [9:7]; default: 0;
 *  In the master mode the bits are the polarity of spi cs line, the value is
 *  equivalent to spi_cs ^ spi_master_cs_pol. Can be configured in CONF state.
 */
#define LP_REG_MASTER_CS_POL    0x00000007U
#define LP_REG_MASTER_CS_POL_M  (LP_REG_MASTER_CS_POL_V << LP_REG_MASTER_CS_POL_S)
#define LP_REG_MASTER_CS_POL_V  0x00000007U
#define LP_REG_MASTER_CS_POL_S  7
/** LP_REG_SLAVE_CS_POL : R/W; bitpos: [23]; default: 0;
 *  spi slave input cs polarity select. 1: inv  0: not change. Can be configured in
 *  CONF state.
 */
#define LP_REG_SLAVE_CS_POL    (BIT(23))
#define LP_REG_SLAVE_CS_POL_M  (LP_REG_SLAVE_CS_POL_V << LP_REG_SLAVE_CS_POL_S)
#define LP_REG_SLAVE_CS_POL_V  0x00000001U
#define LP_REG_SLAVE_CS_POL_S  23
/** LP_REG_CK_IDLE_EDGE : R/W; bitpos: [29]; default: 0;
 *  1: spi clk line is high when idle     0: spi clk line is low when idle. Can be
 *  configured in CONF state.
 */
#define LP_REG_CK_IDLE_EDGE    (BIT(29))
#define LP_REG_CK_IDLE_EDGE_M  (LP_REG_CK_IDLE_EDGE_V << LP_REG_CK_IDLE_EDGE_S)
#define LP_REG_CK_IDLE_EDGE_V  0x00000001U
#define LP_REG_CK_IDLE_EDGE_S  29
/** LP_REG_CS_KEEP_ACTIVE : R/W; bitpos: [30]; default: 0;
 *  spi cs line keep low when the bit is set. Can be configured in CONF state.
 */
#define LP_REG_CS_KEEP_ACTIVE    (BIT(30))
#define LP_REG_CS_KEEP_ACTIVE_M  (LP_REG_CS_KEEP_ACTIVE_V << LP_REG_CS_KEEP_ACTIVE_S)
#define LP_REG_CS_KEEP_ACTIVE_V  0x00000001U
#define LP_REG_CS_KEEP_ACTIVE_S  30

/** LP_SPI_DIN_MODE_REG register
 *  SPI input delay mode configuration
 */
#define LP_SPI_DIN_MODE_REG (DR_REG_LP_BASE + 0x24)
/** LP_REG_DIN0_MODE : R/W; bitpos: [1:0]; default: 0;
 *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
 *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk. Can be configured in CONF state.
 */
#define LP_REG_DIN0_MODE    0x00000003U
#define LP_REG_DIN0_MODE_M  (LP_REG_DIN0_MODE_V << LP_REG_DIN0_MODE_S)
#define LP_REG_DIN0_MODE_V  0x00000003U
#define LP_REG_DIN0_MODE_S  0
/** LP_REG_DIN1_MODE : R/W; bitpos: [3:2]; default: 0;
 *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
 *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk. Can be configured in CONF state.
 */
#define LP_REG_DIN1_MODE    0x00000003U
#define LP_REG_DIN1_MODE_M  (LP_REG_DIN1_MODE_V << LP_REG_DIN1_MODE_S)
#define LP_REG_DIN1_MODE_V  0x00000003U
#define LP_REG_DIN1_MODE_S  2
/** LP_REG_DIN2_MODE : R/W; bitpos: [5:4]; default: 0;
 *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
 *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk. Can be configured in CONF state.
 */
#define LP_REG_DIN2_MODE    0x00000003U
#define LP_REG_DIN2_MODE_M  (LP_REG_DIN2_MODE_V << LP_REG_DIN2_MODE_S)
#define LP_REG_DIN2_MODE_V  0x00000003U
#define LP_REG_DIN2_MODE_S  4
/** LP_REG_DIN3_MODE : R/W; bitpos: [7:6]; default: 0;
 *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
 *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk. Can be configured in CONF state.
 */
#define LP_REG_DIN3_MODE    0x00000003U
#define LP_REG_DIN3_MODE_M  (LP_REG_DIN3_MODE_V << LP_REG_DIN3_MODE_S)
#define LP_REG_DIN3_MODE_V  0x00000003U
#define LP_REG_DIN3_MODE_S  6
/** LP_REG_TIMING_HCLK_ACTIVE : R/W; bitpos: [16]; default: 0;
 *  1:enable hclk in SPI input timing module.  0: disable it. Can be configured in CONF
 *  state.
 */
#define LP_REG_TIMING_HCLK_ACTIVE    (BIT(16))
#define LP_REG_TIMING_HCLK_ACTIVE_M  (LP_REG_TIMING_HCLK_ACTIVE_V << LP_REG_TIMING_HCLK_ACTIVE_S)
#define LP_REG_TIMING_HCLK_ACTIVE_V  0x00000001U
#define LP_REG_TIMING_HCLK_ACTIVE_S  16

/** LP_SPI_DIN_NUM_REG register
 *  SPI input delay number configuration
 */
#define LP_SPI_DIN_NUM_REG (DR_REG_LP_BASE + 0x28)
/** LP_REG_DIN0_NUM : R/W; bitpos: [1:0]; default: 0;
 *  the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...  Can be configured in CONF state.
 */
#define LP_REG_DIN0_NUM    0x00000003U
#define LP_REG_DIN0_NUM_M  (LP_REG_DIN0_NUM_V << LP_REG_DIN0_NUM_S)
#define LP_REG_DIN0_NUM_V  0x00000003U
#define LP_REG_DIN0_NUM_S  0
/** LP_REG_DIN1_NUM : R/W; bitpos: [3:2]; default: 0;
 *  the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...  Can be configured in CONF state.
 */
#define LP_REG_DIN1_NUM    0x00000003U
#define LP_REG_DIN1_NUM_M  (LP_REG_DIN1_NUM_V << LP_REG_DIN1_NUM_S)
#define LP_REG_DIN1_NUM_V  0x00000003U
#define LP_REG_DIN1_NUM_S  2
/** LP_REG_DIN2_NUM : R/W; bitpos: [5:4]; default: 0;
 *  the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...  Can be configured in CONF state.
 */
#define LP_REG_DIN2_NUM    0x00000003U
#define LP_REG_DIN2_NUM_M  (LP_REG_DIN2_NUM_V << LP_REG_DIN2_NUM_S)
#define LP_REG_DIN2_NUM_V  0x00000003U
#define LP_REG_DIN2_NUM_S  4
/** LP_REG_DIN3_NUM : R/W; bitpos: [7:6]; default: 0;
 *  the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...  Can be configured in CONF state.
 */
#define LP_REG_DIN3_NUM    0x00000003U
#define LP_REG_DIN3_NUM_M  (LP_REG_DIN3_NUM_V << LP_REG_DIN3_NUM_S)
#define LP_REG_DIN3_NUM_V  0x00000003U
#define LP_REG_DIN3_NUM_S  6

/** LP_SPI_DOUT_MODE_REG register
 *  SPI output delay mode configuration
 */
#define LP_SPI_DOUT_MODE_REG (DR_REG_LP_BASE + 0x2c)
/** LP_REG_DOUT0_MODE : R/W; bitpos: [0]; default: 0;
 *  The output signal $n is delayed by the SPI module clock, 0: output without delayed,
 *  1: output delay for a SPI module clock cycle at its negative edge. Can be
 *  configured in CONF state.
 */
#define LP_REG_DOUT0_MODE    (BIT(0))
#define LP_REG_DOUT0_MODE_M  (LP_REG_DOUT0_MODE_V << LP_REG_DOUT0_MODE_S)
#define LP_REG_DOUT0_MODE_V  0x00000001U
#define LP_REG_DOUT0_MODE_S  0
/** LP_REG_DOUT1_MODE : R/W; bitpos: [1]; default: 0;
 *  The output signal $n is delayed by the SPI module clock, 0: output without delayed,
 *  1: output delay for a SPI module clock cycle at its negative edge. Can be
 *  configured in CONF state.
 */
#define LP_REG_DOUT1_MODE    (BIT(1))
#define LP_REG_DOUT1_MODE_M  (LP_REG_DOUT1_MODE_V << LP_REG_DOUT1_MODE_S)
#define LP_REG_DOUT1_MODE_V  0x00000001U
#define LP_REG_DOUT1_MODE_S  1
/** LP_REG_DOUT2_MODE : R/W; bitpos: [2]; default: 0;
 *  The output signal $n is delayed by the SPI module clock, 0: output without delayed,
 *  1: output delay for a SPI module clock cycle at its negative edge. Can be
 *  configured in CONF state.
 */
#define LP_REG_DOUT2_MODE    (BIT(2))
#define LP_REG_DOUT2_MODE_M  (LP_REG_DOUT2_MODE_V << LP_REG_DOUT2_MODE_S)
#define LP_REG_DOUT2_MODE_V  0x00000001U
#define LP_REG_DOUT2_MODE_S  2
/** LP_REG_DOUT3_MODE : R/W; bitpos: [3]; default: 0;
 *  The output signal $n is delayed by the SPI module clock, 0: output without delayed,
 *  1: output delay for a SPI module clock cycle at its negative edge. Can be
 *  configured in CONF state.
 */
#define LP_REG_DOUT3_MODE    (BIT(3))
#define LP_REG_DOUT3_MODE_M  (LP_REG_DOUT3_MODE_V << LP_REG_DOUT3_MODE_S)
#define LP_REG_DOUT3_MODE_V  0x00000001U
#define LP_REG_DOUT3_MODE_S  3

/** LP_SPI_DMA_CONF_REG register
 *  SPI DMA control register
 */
#define LP_SPI_DMA_CONF_REG (DR_REG_LP_BASE + 0x30)
/** LP_REG_RX_AFIFO_RST : WT; bitpos: [29]; default: 0;
 *  Set this bit to reset RX AFIFO, which is used to receive data in SPI master and
 *  slave mode transfer.
 */
#define LP_REG_RX_AFIFO_RST    (BIT(29))
#define LP_REG_RX_AFIFO_RST_M  (LP_REG_RX_AFIFO_RST_V << LP_REG_RX_AFIFO_RST_S)
#define LP_REG_RX_AFIFO_RST_V  0x00000001U
#define LP_REG_RX_AFIFO_RST_S  29
/** LP_REG_BUF_AFIFO_RST : WT; bitpos: [30]; default: 0;
 *  Set this bit to reset BUF TX AFIFO, which is used send data out in SPI slave CPU
 *  controlled mode transfer and master mode transfer.
 */
#define LP_REG_BUF_AFIFO_RST    (BIT(30))
#define LP_REG_BUF_AFIFO_RST_M  (LP_REG_BUF_AFIFO_RST_V << LP_REG_BUF_AFIFO_RST_S)
#define LP_REG_BUF_AFIFO_RST_V  0x00000001U
#define LP_REG_BUF_AFIFO_RST_S  30

