espressif/esp-idf/components/soc/esp32s31/register/soc/lp_spi_reg.h
/** LP_SPI_DMA_INT_RAW_REG register
 *  SPI DMA interrupt raw register
 */
#define LP_SPI_DMA_INT_RAW_REG (DR_REG_LP_BASE + 0x3c)
/** LP_REG_SLV_RD_BUF_DONE_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw bit for SPI_SLV_RD_BUF_DONE_INT interrupt. 1: SPI slave mode Rd_BUF
 *  transmission is ended. 0: Others.
 */
#define LP_REG_SLV_RD_BUF_DONE_INT_RAW    (BIT(10))
#define LP_REG_SLV_RD_BUF_DONE_INT_RAW_M  (LP_REG_SLV_RD_BUF_DONE_INT_RAW_V << LP_REG_SLV_RD_BUF_DONE_INT_RAW_S)
#define LP_REG_SLV_RD_BUF_DONE_INT_RAW_V  0x00000001U
#define LP_REG_SLV_RD_BUF_DONE_INT_RAW_S  10
/** LP_REG_SLV_WR_BUF_DONE_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw bit for SPI_SLV_WR_BUF_DONE_INT interrupt. 1: SPI slave mode Wr_BUF
 *  transmission is ended. 0: Others.
 */
#define LP_REG_SLV_WR_BUF_DONE_INT_RAW    (BIT(11))
#define LP_REG_SLV_WR_BUF_DONE_INT_RAW_M  (LP_REG_SLV_WR_BUF_DONE_INT_RAW_V << LP_REG_SLV_WR_BUF_DONE_INT_RAW_S)
#define LP_REG_SLV_WR_BUF_DONE_INT_RAW_V  0x00000001U
#define LP_REG_SLV_WR_BUF_DONE_INT_RAW_S  11
/** LP_REG_TRANS_DONE_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw bit for SPI_TRANS_DONE_INT interrupt. 1: SPI master mode transmission is
 *  ended. 0: others.
 */
#define LP_REG_TRANS_DONE_INT_RAW    (BIT(12))
#define LP_REG_TRANS_DONE_INT_RAW_M  (LP_REG_TRANS_DONE_INT_RAW_V << LP_REG_TRANS_DONE_INT_RAW_S)
#define LP_REG_TRANS_DONE_INT_RAW_V  0x00000001U
#define LP_REG_TRANS_DONE_INT_RAW_S  12
/** LP_REG_SPI_WAKEUP_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  The raw bit for SPI_SPI_WAKEUP_INT interrupt. 1: There is a  wake up signal when
 *  low power mode. 0: Others.
 */
#define LP_REG_SPI_WAKEUP_INT_RAW    (BIT(14))
#define LP_REG_SPI_WAKEUP_INT_RAW_M  (LP_REG_SPI_WAKEUP_INT_RAW_V << LP_REG_SPI_WAKEUP_INT_RAW_S)
#define LP_REG_SPI_WAKEUP_INT_RAW_V  0x00000001U
#define LP_REG_SPI_WAKEUP_INT_RAW_S  14
/** LP_REG_SLV_BUF_ADDR_ERR_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  The raw bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt. 1: The accessing data address
 *  of the current SPI slave mode CPU controlled FD, Wr_BUF or Rd_BUF transmission is
 *  bigger than 63. 0: Others.
 */
#define LP_REG_SLV_BUF_ADDR_ERR_INT_RAW    (BIT(15))
#define LP_REG_SLV_BUF_ADDR_ERR_INT_RAW_M  (LP_REG_SLV_BUF_ADDR_ERR_INT_RAW_V << LP_REG_SLV_BUF_ADDR_ERR_INT_RAW_S)
#define LP_REG_SLV_BUF_ADDR_ERR_INT_RAW_V  0x00000001U
#define LP_REG_SLV_BUF_ADDR_ERR_INT_RAW_S  15
/** LP_REG_SLV_CMD_ERR_INT_RAW : R/WTC/SS; bitpos: [16]; default: 0;
 *  The raw bit for SPI_SLV_CMD_ERR_INT interrupt. 1: The slave command value in the
 *  current SPI slave HD mode transmission is not supported. 0: Others.
 */
#define LP_REG_SLV_CMD_ERR_INT_RAW    (BIT(16))
#define LP_REG_SLV_CMD_ERR_INT_RAW_M  (LP_REG_SLV_CMD_ERR_INT_RAW_V << LP_REG_SLV_CMD_ERR_INT_RAW_S)
#define LP_REG_SLV_CMD_ERR_INT_RAW_V  0x00000001U
#define LP_REG_SLV_CMD_ERR_INT_RAW_S  16
/** LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_RAW : R/WTC/SS; bitpos: [17]; default: 0;
 *  The raw bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt. 1: There is a RX AFIFO
 *  write-full error when SPI inputs data in master mode. 0: Others.
 */
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_RAW    (BIT(17))
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_RAW_M  (LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_RAW_V << LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_RAW_S)
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_RAW_V  0x00000001U
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_RAW_S  17
/** LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 *  The raw bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt. 1: There is a TX BUF
 *  AFIFO read-empty error when SPI outputs data in master mode. 0: Others.
 */
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_RAW    (BIT(18))
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_RAW_M  (LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_RAW_V << LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_RAW_S)
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_RAW_V  0x00000001U
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_RAW_S  18
/** LP_REG_APP2_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 *  The raw bit for SPI_APP2_INT interrupt. The value is only controlled by application.
 */
#define LP_REG_APP2_INT_RAW    (BIT(19))
#define LP_REG_APP2_INT_RAW_M  (LP_REG_APP2_INT_RAW_V << LP_REG_APP2_INT_RAW_S)
#define LP_REG_APP2_INT_RAW_V  0x00000001U
#define LP_REG_APP2_INT_RAW_S  19
/** LP_REG_APP1_INT_RAW : R/WTC/SS; bitpos: [20]; default: 0;
 *  The raw bit for SPI_APP1_INT interrupt. The value is only controlled by application.
 */
#define LP_REG_APP1_INT_RAW    (BIT(20))
#define LP_REG_APP1_INT_RAW_M  (LP_REG_APP1_INT_RAW_V << LP_REG_APP1_INT_RAW_S)
#define LP_REG_APP1_INT_RAW_V  0x00000001U
#define LP_REG_APP1_INT_RAW_S  20

/** LP_SPI_DMA_INT_ST_REG register
 *  SPI DMA interrupt status register
 */
#define LP_SPI_DMA_INT_ST_REG (DR_REG_LP_BASE + 0x40)
/** LP_REG_SLV_RD_BUF_DONE_INT_ST : RO; bitpos: [10]; default: 0;
 *  The status bit for SPI_SLV_RD_BUF_DONE_INT interrupt.
 */
#define LP_REG_SLV_RD_BUF_DONE_INT_ST    (BIT(10))
#define LP_REG_SLV_RD_BUF_DONE_INT_ST_M  (LP_REG_SLV_RD_BUF_DONE_INT_ST_V << LP_REG_SLV_RD_BUF_DONE_INT_ST_S)
#define LP_REG_SLV_RD_BUF_DONE_INT_ST_V  0x00000001U
#define LP_REG_SLV_RD_BUF_DONE_INT_ST_S  10
/** LP_REG_SLV_WR_BUF_DONE_INT_ST : RO; bitpos: [11]; default: 0;
 *  The status bit for SPI_SLV_WR_BUF_DONE_INT interrupt.
 */
#define LP_REG_SLV_WR_BUF_DONE_INT_ST    (BIT(11))
#define LP_REG_SLV_WR_BUF_DONE_INT_ST_M  (LP_REG_SLV_WR_BUF_DONE_INT_ST_V << LP_REG_SLV_WR_BUF_DONE_INT_ST_S)
#define LP_REG_SLV_WR_BUF_DONE_INT_ST_V  0x00000001U
#define LP_REG_SLV_WR_BUF_DONE_INT_ST_S  11
/** LP_REG_TRANS_DONE_INT_ST : RO; bitpos: [12]; default: 0;
 *  The status bit for SPI_TRANS_DONE_INT interrupt.
 */
#define LP_REG_TRANS_DONE_INT_ST    (BIT(12))
#define LP_REG_TRANS_DONE_INT_ST_M  (LP_REG_TRANS_DONE_INT_ST_V << LP_REG_TRANS_DONE_INT_ST_S)
#define LP_REG_TRANS_DONE_INT_ST_V  0x00000001U
#define LP_REG_TRANS_DONE_INT_ST_S  12
/** LP_REG_SPI_WAKEUP_INT_ST : RO; bitpos: [14]; default: 0;
 *  reserved
 */
#define LP_REG_SPI_WAKEUP_INT_ST    (BIT(14))
#define LP_REG_SPI_WAKEUP_INT_ST_M  (LP_REG_SPI_WAKEUP_INT_ST_V << LP_REG_SPI_WAKEUP_INT_ST_S)
#define LP_REG_SPI_WAKEUP_INT_ST_V  0x00000001U
#define LP_REG_SPI_WAKEUP_INT_ST_S  14
/** LP_REG_SLV_BUF_ADDR_ERR_INT_ST : RO; bitpos: [15]; default: 0;
 *  The status bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt.
 */
#define LP_REG_SLV_BUF_ADDR_ERR_INT_ST    (BIT(15))
#define LP_REG_SLV_BUF_ADDR_ERR_INT_ST_M  (LP_REG_SLV_BUF_ADDR_ERR_INT_ST_V << LP_REG_SLV_BUF_ADDR_ERR_INT_ST_S)
#define LP_REG_SLV_BUF_ADDR_ERR_INT_ST_V  0x00000001U
#define LP_REG_SLV_BUF_ADDR_ERR_INT_ST_S  15
/** LP_REG_SLV_CMD_ERR_INT_ST : RO; bitpos: [16]; default: 0;
 *  The status bit for SPI_SLV_CMD_ERR_INT interrupt.
 */
#define LP_REG_SLV_CMD_ERR_INT_ST    (BIT(16))
#define LP_REG_SLV_CMD_ERR_INT_ST_M  (LP_REG_SLV_CMD_ERR_INT_ST_V << LP_REG_SLV_CMD_ERR_INT_ST_S)
#define LP_REG_SLV_CMD_ERR_INT_ST_V  0x00000001U
#define LP_REG_SLV_CMD_ERR_INT_ST_S  16
/** LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ST : RO; bitpos: [17]; default: 0;
 *  The status bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.
 */
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ST    (BIT(17))
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ST_M  (LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ST_V << LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ST_S)
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ST_V  0x00000001U
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ST_S  17
/** LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ST : RO; bitpos: [18]; default: 0;
 *  The status bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.
 */
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ST    (BIT(18))
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ST_M  (LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ST_V << LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ST_S)
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ST_V  0x00000001U
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ST_S  18
/** LP_REG_APP2_INT_ST : RO; bitpos: [19]; default: 0;
 *  The status bit for SPI_APP2_INT interrupt.
 */
#define LP_REG_APP2_INT_ST    (BIT(19))
#define LP_REG_APP2_INT_ST_M  (LP_REG_APP2_INT_ST_V << LP_REG_APP2_INT_ST_S)
#define LP_REG_APP2_INT_ST_V  0x00000001U
#define LP_REG_APP2_INT_ST_S  19
/** LP_REG_APP1_INT_ST : RO; bitpos: [20]; default: 0;
 *  The status bit for SPI_APP1_INT interrupt.
 */
#define LP_REG_APP1_INT_ST    (BIT(20))
#define LP_REG_APP1_INT_ST_M  (LP_REG_APP1_INT_ST_V << LP_REG_APP1_INT_ST_S)
#define LP_REG_APP1_INT_ST_V  0x00000001U
#define LP_REG_APP1_INT_ST_S  20

/** LP_SPI_SLEEP_CONF0_REG register
 *  NA
 */
#define LP_SPI_SLEEP_CONF0_REG (DR_REG_LP_BASE + 0x44)
/** LP_REG_SLV_WK_CHAR0 : R/W; bitpos: [7:0]; default: 10;
 *  NA
 */
#define LP_REG_SLV_WK_CHAR0    0x000000FFU
#define LP_REG_SLV_WK_CHAR0_M  (LP_REG_SLV_WK_CHAR0_V << LP_REG_SLV_WK_CHAR0_S)
#define LP_REG_SLV_WK_CHAR0_V  0x000000FFU
#define LP_REG_SLV_WK_CHAR0_S  0
/** LP_REG_SLV_WK_CHAR_NUM : R/W; bitpos: [10:8]; default: 0;
 *  NA
 */
#define LP_REG_SLV_WK_CHAR_NUM    0x00000007U
#define LP_REG_SLV_WK_CHAR_NUM_M  (LP_REG_SLV_WK_CHAR_NUM_V << LP_REG_SLV_WK_CHAR_NUM_S)
#define LP_REG_SLV_WK_CHAR_NUM_V  0x00000007U
#define LP_REG_SLV_WK_CHAR_NUM_S  8
/** LP_REG_SLV_WK_CHAR_MASK : R/W; bitpos: [15:11]; default: 0;
 *  NA
 */
#define LP_REG_SLV_WK_CHAR_MASK    0x0000001FU
#define LP_REG_SLV_WK_CHAR_MASK_M  (LP_REG_SLV_WK_CHAR_MASK_V << LP_REG_SLV_WK_CHAR_MASK_S)
#define LP_REG_SLV_WK_CHAR_MASK_V  0x0000001FU
#define LP_REG_SLV_WK_CHAR_MASK_S  11
/** LP_REG_SLV_WK_MODE_SEL : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define LP_REG_SLV_WK_MODE_SEL    (BIT(16))
#define LP_REG_SLV_WK_MODE_SEL_M  (LP_REG_SLV_WK_MODE_SEL_V << LP_REG_SLV_WK_MODE_SEL_S)
#define LP_REG_SLV_WK_MODE_SEL_V  0x00000001U
#define LP_REG_SLV_WK_MODE_SEL_S  16
/** LP_REG_SLEEP_EN : R/W; bitpos: [17]; default: 0;
 *  NA
 */
#define LP_REG_SLEEP_EN    (BIT(17))
#define LP_REG_SLEEP_EN_M  (LP_REG_SLEEP_EN_V << LP_REG_SLEEP_EN_S)
#define LP_REG_SLEEP_EN_V  0x00000001U
#define LP_REG_SLEEP_EN_S  17
/** LP_REG_SLEEP_DIS_RXFIFO_WR_EN : R/W; bitpos: [18]; default: 0;
 *  NA
 */
#define LP_REG_SLEEP_DIS_RXFIFO_WR_EN    (BIT(18))
#define LP_REG_SLEEP_DIS_RXFIFO_WR_EN_M  (LP_REG_SLEEP_DIS_RXFIFO_WR_EN_V << LP_REG_SLEEP_DIS_RXFIFO_WR_EN_S)
#define LP_REG_SLEEP_DIS_RXFIFO_WR_EN_V  0x00000001U
#define LP_REG_SLEEP_DIS_RXFIFO_WR_EN_S  18
/** LP_REG_SLEEP_WK_DATA_SEL : R/W; bitpos: [19]; default: 0;
 *  NA
 */
#define LP_REG_SLEEP_WK_DATA_SEL    (BIT(19))
#define LP_REG_SLEEP_WK_DATA_SEL_M  (LP_REG_SLEEP_WK_DATA_SEL_V << LP_REG_SLEEP_WK_DATA_SEL_S)
#define LP_REG_SLEEP_WK_DATA_SEL_V  0x00000001U
#define LP_REG_SLEEP_WK_DATA_SEL_S  19

